2026-02 - 19 @09: 19
    // - จองไม่มีหมอ ตรวจสอบเวลาหมอทุกคนว่างก่อน ถ้าหมอทุกคนไม่ว่าง ให้ disable
    // - แจ้งเตือน เมื่อโอนมัดจำไม่ได้ ให้โทรติดต่อเจ้าหน้าที่
    // - ไม่ต้อง confirm ก็ lock เวลาไปเลย ไม่ให้จองซ้ำ
    // - ตารางรวมค่าใช้จ่ายหมอ
    // - ข้อมูลเคส ไม่ complete แสดงยอดเงินค่ามือ pending
    // - เคสที่เสร็จแล้ว ให้แสดงยอดเงินค่ามือ
    // - รูปแสดงสีตามคะแนนความเจ็บ
    // - เวลา หมอ อาการ ไม่ครบ submit ไม่ได้ ต้องเจ็บอย่างน้อย 1 ที่
    // - ขึ้นเตือนหาก คะแนนความเจ็บต่ำกว่า 500
    // - เพิ่มจำนวนเงินที่ลด หากเลือกลดเป็น % 
    // - เพิ่ม option การเก็บเงิน เงินสด / โอน
    // - การวินิจฉัยโรค เพิ่มเป็น multiple dropdown
    // - รายละเอียดการรักษา บันทึกรูปแบบการรักษา pre enter
    // - ชื่อเป็นสีแดง / มี icon แสดงคุณสมบัติพิเศษ เช่น เคยผ่าตัด หรือ มีโรคประจำตัว
    // - ใบเสร็จ เชื่อคนพิมพ์ ตามคน login เป็น default แต่ให้ เลือกใหม่ได้
    // - หน้า config เพิ่ม user
    // - slot เจ้าหน้าที่อาจปรับ จนท นัด 7 - 22, ลกค้า จองนัด 9 - 20
    - ข้อลูกค้า excel CN, firstname, lastname
        // - ปรับหมอให้ไม่มีในรายการจองคิวนัดหมาย หากหมอไม่ว่างทำงาน แต่ยังมีในระบบ
        // หากชำระเงินไม่ได้ ขอภาษาอังกฤษด้วย
        // หมอสามารถกำหนดได้ จะมาทำงานกี่โมงถึงกี่โมง ตั้งค่าได้ทำงานวันไหน กี่โมงทำงาน กี่โมงไม่ว่างทำงาน กี่โมงทำงานถึงไหน
        // ตั้งค่าหมอ อาทิตย์นึงมาวันไหนบ้าง ทำหมอหยุดละเอียดเหมือนกัน
        // คนจองเพิ่ม ระยะเวลา ว่าจะเอาเท่าไหร่ เริ่มต้นที่ 1 ต้องเลือกก่อน
        สามารถปริ้สร์ได้ ว่าไม่ครบกี่คน ครบกี่คน
// เพิ่มป๊อปโหเวอร์ ที่ตำแหน่งที่ปวด
// เพิ่ม สร้างตัวเลือกใหม่ได้ในรายละเอียดการรักษา
ยืนยันบอกรายละเอียดสรุป

2026-02 - 28 @10: 55

    // - ปรับ user เพิ่ม is_owner สำหรับเจ้าของ
    // - ปรับ user เพิ่ม is_client สำหรับลูกค้า
    // - นำ hardcode cahil23377@gmail.com ออกจาก logic
    // - วันที่ปฎิทิน หากไม่ว่าง ควรแสดงเตือนว่าไม่มีหมอว่างในข่วงเวลาทีท่านเลือก และ แสดงเวลาว่างถัดไปให้ทราบ
    // - ควร disabled วันที่หยุด และ วันที่ในอดีต ที่ไม่สามารถจองได้
    // - ควร disabled วันที่หมอไม่ว่าง
    // - ควรมี indicator แสดงวันที่ปัจจะบัน
    // - กำหนดช่วงเวลาการทำงานของหมอแต่ละคน ได้ เพื่อการจอง จะได้ไม่ต้องจองเวลาที่หมอไม่ว่าง
    // - หมอแต่ละคนมีวันหยุดไม่เหมือนกัน ตั้งค่าวันหยุดได้
    // - หมอบางคนอาจทำงานแค่ 2 วัน ในช่วงบ่าย
    // - หมอบางคนอาจทำงานแค่ 2 วัน ในช่วงเช้า
    // - หมอบางคนอาจทำงาน 3 วัน ทั้งวัน
    // - หน้าจอง default ว่างไว้ บังคับให้เลือก และสามารถปรับเพิ่มได้
    // - อาจมี option ซ่อน record ในหน้า admin อาจเป็น route ลับที่ไม่มี link
    //     - กด ซ่อน visit และการจ่ายเงินต่างๆ ออกไป เพื่อลดยอดรายได้
    //         - หน้า route ลับนี้ จะแสดงครบ
    //             - หน้าปกติ แสดงเฉพาะรายการที่ไม่ได้ถูกซ่อน
    //                 - สรุปตาราง ความสมบูรณ์ข้อมูล ว่า ทั้งหมดเท่าไร, สมบูรณ์เท่าไร, ขาดเท่าไร
    - link จอง เพิ่มใน LINE OA คลินิก
        // - เพิ่ม pophover แสดงอาการ และ ระดับเจ็บปวด เมื่อ hover ชิ้นส่วนร่างกาย
        - สรุปยืนยันจบ visit อาการ วันนัด ยอดขำระ ค่ามือ ค่าทิป

            / admin / owner - dashboard ? show_hidden = 1