2026-02 - 19 @09: 19
    - จองไม่มีหมอ ตรวจสอบเวลาหมอทุกคนว่างก่อน ถ้าหมอทุกคนไม่ว่าง ให้ disable
        // - แจ้งเตือน เมื่อโอนมัดจำไม่ได้ ให้โทรติดต่อเจ้าหน้าที่
        - ไม่ต้อง confirm ก็ lock เวลาไปเลย ไม่ให้จองซ้ำ
            // - ตารางรวมค่าใช้จ่ายหมอ
            - ข้อมูลเคส ไม่ complete แสดงยอดเงินค่ามือ pending
                - เคสที่เสร็จแล้ว ให้แสดงยอดเงินค่ามือ
                    // - รูปแสดงสีตามคะแนนความเจ็บ
                    - เวลา หมอ อาการ ไม่ครบ submit ไม่ได้ ต้องเจ็บอย่างน้อย 1 ที่
                        // - ขึ้นเตือนหาก คะแนนความเจ็บต่ำกว่า 500
                        // - เพิ่มจำนวนเงินที่ลด หากเลือกลดเป็น % 
                        // - เพิ่ม option การเก็บเงิน เงินสด / โอน
                        // - การวินิจฉัยโรค เพิ่มเป็น multiple dropdown
                        - รายละเอียดการรักษา บันทึกรูปแบบการรักษา pre enter
                            // - ชื่อเป็นสีแดง / มี icon แสดงคุณสมบัติพิเศษ เช่น เคยผ่าตัด หรือ มีโรคประจำตัว
                            - ใบเสร็จ เชื่อคนพิมพ์ ตามคน login เป็น default แต่ให้ เลือกใหม่ได้
                                - หน้า config เพิ่ม user
                                    - slot เจ้าหน้าที่อาจปรับ จนท นัด 7 - 22, ลกค้า จองนัด 9 - 20
                                        - ข้อลูกค้า excel CN, firstname, lastname